#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
aws_kms_key.encrytion_rest: Refreshing state... [id=d25d563f-9511-4831-9aee-0823f480e665]
aws_vpc.this: Refreshing state... [id=vpc-0aee610d9ee2f5056]
aws_kms_key.encrytion_secret: Refreshing state... [id=49c814dd-0c0f-4e8d-8dc1-4e4b5f688166]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-2]
aws_secretsmanager_secret.elasticache_auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD]
aws_secretsmanager_secret_version.auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD|8928B07B-E518-404C-91FB-015779DEFB0D]
aws_route_table.public: Refreshing state... [id=rtb-07a879baced138b59]
aws_security_group.elasticache: Refreshing state... [id=sg-0ed1869e3d212ceff]
aws_route_table.private[1]: Refreshing state... [id=rtb-09c463d4787f20931]
aws_subnet.public[0]: Refreshing state... [id=subnet-01504aaf919b844a2]
aws_route_table.private[2]: Refreshing state... [id=rtb-0be19402a8902cddc]
aws_subnet.private[1]: Refreshing state... [id=subnet-00445199ef90108e3]
aws_subnet.private[2]: Refreshing state... [id=subnet-052cb9788e3699e42]
aws_subnet.private[0]: Refreshing state... [id=subnet-0d793fee34548d46b]
aws_default_security_group.default: Refreshing state... [id=sg-017656e5a4e187b27]
aws_route_table.private[0]: Refreshing state... [id=rtb-00fd94662b273fa5f]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-049a33ab4984be2a1]
aws_elasticache_subnet_group.elasticache_subnet: Refreshing state... [id=cache-subnet]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ec28b2c44b0623b5]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07474438f8d7717f5]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a3cfb9c7b6d62162]
aws_elasticache_replication_group.app4: Refreshing state... [id=app-4-redis-cluster]
aws_ssm_parameter.elasticache_port: Refreshing state... [id=/elasticache/app-4-redis-cluster/port]
aws_ssm_parameter.elasticache_ep: Refreshing state... [id=/elasticache/app-4-redis-cluster/endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_elasticache_replication_group.app4 must be replaced
-/+ resource "aws_elasticache_replication_group" "app4" {
      ~ arn                            = "arn:aws:elasticache:us-east-2:743794601996:replicationgroup:app-4-redis-cluster" -> (known after apply)
      ~ auto_minor_version_upgrade     = "true" -> (known after apply)
      ~ cluster_enabled                = true -> (known after apply)
      ~ configuration_endpoint_address = "clustercfg.app-4-redis-cluster.p6gser.use2.cache.amazonaws.com" -> (known after apply)
      ~ data_tiering_enabled           = false -> (known after apply)
      ~ engine_version                 = "7.0" -> (known after apply)
      ~ engine_version_actual          = "7.0.7" -> (known after apply)
      + global_replication_group_id    = (known after apply)
      ~ id                             = "app-4-redis-cluster" -> (known after apply)
      ~ kms_key_id                     = "arn:aws:kms:us-east-2:743794601996:key/d25d563f-9511-4831-9aee-0823f480e665" -> "d25d563f-9511-4831-9aee-0823f480e665"
      ~ maintenance_window             = "sat:03:00-sat:04:00" -> (known after apply)
      ~ member_clusters                = [
          - "app-4-redis-cluster-0001-001",
          - "app-4-redis-cluster-0001-002",
          - "app-4-redis-cluster-0001-003",
          - "app-4-redis-cluster-0002-001",
          - "app-4-redis-cluster-0002-002",
          - "app-4-redis-cluster-0002-003",
          - "app-4-redis-cluster-0003-001",
          - "app-4-redis-cluster-0003-002",
          - "app-4-redis-cluster-0003-003",
        ] -> (known after apply)
      ~ num_cache_clusters             = 9 -> (known after apply)
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      ~ security_group_ids             = [
          - "sg-0ed1869e3d212ceff",
        ] -> (known after apply)
      ~ security_group_names           = [] -> (known after apply)
      - snapshot_retention_limit       = 0 -> null
      ~ snapshot_window                = "01:00-02:00" -> (known after apply)
      ~ subnet_group_name              = "cache-subnet" -> "app-4-cache-subnet" # forces replacement
      - tags                           = {} -> null
      - user_group_ids                 = [] -> null
        # (15 unchanged attributes hidden)
    }

  # aws_elasticache_subnet_group.elasticache_subnet must be replaced
-/+ resource "aws_elasticache_subnet_group" "elasticache_subnet" {
      ~ arn         = "arn:aws:elasticache:us-east-2:743794601996:subnetgroup:cache-subnet" -> (known after apply)
      ~ id          = "cache-subnet" -> (known after apply)
      ~ name        = "cache-subnet" -> "app-4-cache-subnet" # forces replacement
      - tags        = {} -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.secret_manager_policy will be created
  + resource "aws_iam_policy" "secret_manager_policy" {
      + arn         = (known after apply)
      + description = "Policy to read the ElastiCache AUTH Token stored in AWS Secrets Manager secret."
      + id          = (known after apply)
      + name        = "app-4-secret-read-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:us-east-2:743794601996:key/d25d563f-9511-4831-9aee-0823f480e665",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
    }

  # aws_iam_policy.ssm_parameter_policy will be created
  + resource "aws_iam_policy" "ssm_parameter_policy" {
      + arn         = (known after apply)
      + description = "Policy to read the ElastiCache endpoint and port number stored in the SSM Parameter Store."
      + id          = (known after apply)
      + name        = "app-4-ssm-parameter-read-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
    }

  # aws_secretsmanager_secret.elasticache_auth must be replaced
-/+ resource "aws_secretsmanager_secret" "elasticache_auth" {
      ~ arn                            = "arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD" -> (known after apply)
      ~ name                           = "elasticache_auth" -> "app-4-elasticache-auth" # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      - tags                           = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.auth must be replaced
-/+ resource "aws_secretsmanager_secret_version" "auth" {
      ~ arn            = "arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD|8928B07B-E518-404C-91FB-015779DEFB0D" -> (known after apply)
      ~ secret_id      = "arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD" # forces replacement -> (known after apply) # forces replacement
      ~ version_id     = "8928B07B-E518-404C-91FB-015779DEFB0D" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.elasticache must be replaced
-/+ resource "aws_security_group" "elasticache" {
      ~ arn                    = "arn:aws:ec2:us-east-2:743794601996:security-group/sg-0ed1869e3d212ceff" -> (known after apply)
      ~ id                     = "sg-0ed1869e3d212ceff" -> (known after apply)
      ~ name                   = "app-4-elasticache" -> "app-4-elasticache-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "743794601996" -> (known after apply)
      - tags                   = {} -> null
        # (6 unchanged attributes hidden)
    }

  # aws_ssm_parameter.elasticache_ep must be replaced
-/+ resource "aws_ssm_parameter" "elasticache_ep" {
      ~ arn            = "arn:aws:ssm:us-east-2:743794601996:parameter/elasticache/app-4-redis-cluster/endpoint" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "/elasticache/app-4-redis-cluster/endpoint" -> (known after apply)
      + insecure_value = (known after apply)
      ~ name           = "/elasticache/app-4-redis-cluster/endpoint" -> "/elasticache/app-4/app-4-redis-cluster/endpoint" # forces replacement
      - tags           = {} -> null
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_ssm_parameter.elasticache_port must be replaced
-/+ resource "aws_ssm_parameter" "elasticache_port" {
      ~ arn            = "arn:aws:ssm:us-east-2:743794601996:parameter/elasticache/app-4-redis-cluster/port" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "/elasticache/app-4-redis-cluster/port" -> (known after apply)
      + insecure_value = (known after apply)
      ~ name           = "/elasticache/app-4-redis-cluster/port" -> "/elasticache/app-4/app-4-redis-cluster/port" # forces replacement
      - tags           = {} -> null
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*